   ## Task 1

#print("Введіть координати точки щоб дізнатися в якій вона чверті ")
#x = float(input("Введіть координату x: "))
#y = float(input("Введіть координату y: "))

#if y > 0 and x > 0:
#    print("Координати знаходяться в першій чверті.")
#elif y > 0 and x < 0:
#    print("Координати знаходяться в другій чверті.")
#elif y < 0 and x < 0: 
 #   print("Координати знаходяться в третій чверті.")
#elif y < 0 and x > 0:
 #   print("Координати знаходяться в четвертій чверті.")
#elif y == 0 and x == 0:
 #   print("Координати знаходяться в початку координат (0,0).")
#else:
 #   print("Помилка!!")


## Task 2 

print("Напишіть ваше призвіще й кількість балів щоб дізнатися чи склали ви іспит!")
surname = input("Введіть ваше прізвище: ")
points = int(input("Введіть кількість балів: "))

if points > 80:
    print(f"{surname}, здали іспит, вітаю!")
else: 
    print("Ви не здали іспит(")
